In [1]:
#Importing required packages
import pandas as pd
import numpy as np

In [2]:
#declaring a DataFrame with respect to data
df = pd.DataFrame(
                    {
                        'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                        'FlightNumber': [10045, 'nan', 10065, 'nan', 10085],
                        'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                        'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']
                    }
                )

In [3]:
df.info

<bound method DataFrame.info of             From_To FlightNumber  RecentDelays              Airline
0      LoNDon_paris        10045      [23, 47]               KLM(!)
1      MAdrid_miLAN          nan            []    <Air France> (12)
2  londON_StockhOlm        10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          nan          [13]       12. Air France
4   Brussels_londOn        10085      [67, 32]          "Swiss Air">

In [4]:
#1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column(instead of a float column).
df['FlightNumber']

0    10045
1      nan
2    10065
3      nan
4    10085
Name: FlightNumber, dtype: object

In [5]:
#replacing the null values into the FlightNumber,  updating the null value with the previous value + 10
for i in df['FlightNumber'].index:
    if (df['FlightNumber'][i] == 'nan'):
        df['FlightNumber'][i] = df['FlightNumber'][i-1]+10

In [6]:
df.head()

            From_To FlightNumber  RecentDelays              Airline
0      LoNDon_paris        10045      [23, 47]               KLM(!)
1      MAdrid_miLAN        10055            []    <Air France> (12)
2  londON_StockhOlm        10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis        10075          [13]       12. Air France
4   Brussels_londOn        10085      [67, 32]          "Swiss Air"

In [7]:
#splitting from_to to different two columns as from and to 
new_from_to = df["From_To"].str.split("_", n = 1, expand = True)

In [8]:
df['From'] = new_from_to[0]
df['To'] = new_from_to[1]

In [9]:
df.drop(columns =["From_To"], inplace = True)

In [10]:
df

  FlightNumber  RecentDelays              Airline      From         To
0        10045      [23, 47]               KLM(!)    LoNDon      paris
1        10055            []    <Air France> (12)    MAdrid      miLAN
2        10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3        10075          [13]       12. Air France  Budapest      PaRis
4        10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [11]:
# removing specialcharacters from the Airline column
spec_chars = ["!",'"',"#","%","&","'","(",")",
              "*","+",",","-",".","/",":",";","<",
              "=",">","?","@","[","\\","]","^","_",
              "`","{","|","}","~","â€“",]
for char in spec_chars:
    df['Airline'] = df['Airline'].str.replace(char, ' ')
df

  FlightNumber  RecentDelays              Airline      From         To
0        10045      [23, 47]               KLM       LoNDon      paris
1        10055            []     Air France   12     MAdrid      miLAN
2        10065  [24, 43, 87]   British Airways       londON  StockhOlm
3        10075          [13]       12  Air France  Budapest      PaRis
4        10085      [67, 32]           Swiss Air   Brussels     londOn

In [12]:
#replacint Air Frace 12 and 12 Air France with Air France
df['Airline'] = df['Airline'].str.replace('Air France   12', 'Air France')
df['Airline'] = df['Airline'].str.replace('12  Air France', 'Air France')

In [13]:
#checking the max lenth of values in RecentDelays list values and creating new list for createing new columns from the data
mlst=[]
for lst in df['RecentDelays']:
    mlst.append(len(lst))
delay_lst=[]
for i in range(1,max(mlst)+1):
    s="delay_"+ str(i)
    delay_lst.append(s)

In [14]:
# creating a new columns based on the delay_lst
for delay in delay_lst:
    df[delay]='NaN'

In [15]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM,LoNDon,paris,NaN,NaN,NaN
1,10055,[],Air France,MAdrid,miLAN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",British Airways,londON,StockhOlm,NaN,NaN,NaN
3,10075,[13],Air France,Budapest,PaRis,NaN,NaN,NaN
4,10085,"[67, 32]",Swiss Air,Brussels,londOn,NaN,NaN,NaN

In [16]:
#assigining the list values of RecentDelays to delay_1, delay_2, delay_3 
lst=[]
for i in df['RecentDelays'].index:
    if len(df['RecentDelays'][i])<=0 :
        df['delay_1'][i],df['delay_2'][i],df['delay_3'][i]='NaN','NaN','NaN'
    elif len(df['RecentDelays'][i])==1:
        df['delay_1'][i] = df['RecentDelays'][i][0]
    elif len(df['RecentDelays'][i])==2:
        df['delay_1'][i],df['delay_2'][i] = df['RecentDelays'][i][0],df['RecentDelays'][i][1]
    elif len(df['RecentDelays'][i])==3:
        df['delay_1'][i],df['delay_2'][i],df['delay_3'][i] = df['RecentDelays'][i][0],df['RecentDelays'][i][1],df['RecentDelays'][i][2]

In [17]:
#Dropping RecentDelays column from DF
df.drop(['RecentDelays'], axis = 1)

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,LoNDon,paris,23,47,NaN
1,10055,Air France,MAdrid,miLAN,NaN,NaN,NaN
2,10065,British Airways,londON,StockhOlm,24,43,87
3,10075,Air France,Budapest,PaRis,13,NaN,NaN
4,10085,Swiss Air,Brussels,londOn,67,32,NaN